# pkglist.txt
#############
# use with: sed -e "/^#/d" -e "s/#.*//" pkglist.txt | pacman -Syu --needed -

# General
base
sudo
zsh
dialog
stow
wpa_supplicant
openssh
intel-ucode

# Arch Linux Utils
pkgfile

# Useful tools
tmux  # terminal multiplexer, sessions and splits
htop  # process and resorces
ncdu  # disk usage browser
rsync  # file sync locally or through ssh
ranger  # 3-column file browser
w3m  # for ranger image previews, also web browser
# vim  # gvim instead
imagemagick  # lots of image tools, such as screenshotting
zathura  # document viewer
zathura-pdf-mupdf  # pdf and epub plugin for zathura
dmenu  # simple menu to launch applications or choose option in a list

# === Development ===
# = General =
base-devel  # compilers, etc
git
astyle  # style formatter for C, and various other languages
# jq? commanline json processor
# = Shell =
bash-language-server
# shellcheck
# Do I want this? ^
# = Python =
python-pip
python-language-server
# flake8
# Do I want this? ^
# = JSON =
prettier


# Xorg
i3-wm
i3blocks
i3lock
xorg-server
xorg-xinput
gvim
neovim
gimp
xorg-xinit
# xsetroot for i3
# xorg-xsetroot  # doesn't work with compton, but hsetroot does
hsetroot
compton
xclip
ttf-dejavu
rxvt-unicode
firefox-developer-edition
mpv
playerctl  # fn media control for mpv, also requires mpv-mpris
chromium
# feh  # replaced with sxiv
sxiv
youtube-dl

# Is this needed?
# acpi
# bc
# alsa-utils
# sysstat
# atool
# autoconf
# automake
# baobab  # using ncdu, is baobab still useful?
# bind-tools
# binutils
# bpython
# deluge

# AUR
# yay
# mpv-mpris  # playerctl support for mpv
