# pkglist.txt
#############
# use with: sed -e "/^#/d" -e "s/#.*//" pkglist.txt | pacman -Syu --needed -

# General
zsh
vim
sudo
git
tmux
stow
dialog
wpa_supplicant
openssh
intel-ucode
imagemagick
pkgfile
compton
gimp
neovim
astyle
htop
ranger

# Xorg
i3-wm
i3blocks
i3lock
xorg-server
xorg-xinput
xorg-xinit
# xsetroot for i3
xorg-xsetroot
xclip
ttf-dejavu
rxvt-unicode
firefox-developer-edition
mpv
dmenu
chromium
feh
youtube-dl
zathura

# Is this needed?
# acpi
# bc
# playerctl
# alsa-utils
# sysstat
# atool
# autoconf
# automake
# baobab
# bind-tools
# binutils
# bpython
# coreutils
# bash
# cryptsetup
# deluge

# AUR
# yay
