# pkglist.txt
#############
# use with: sed -e "/^#/d" -e "s/#.*//" pkglist.txt | pacman -Syu --needed -

# General
base
base-devel
zsh
# vim # gvim instead
sudo
git
tmux
python-pip
stow
dialog
wpa_supplicant
openssh
intel-ucode
imagemagick
pkgfile
gimp
neovim
astyle
htop
ranger
# for ranger image previews
w3m
rsync
# jq? commanline json processor

# === Development ===
# = Shell =
bash-language-server
# shellcheck
# Do I want this? ^
# = Python =
python-language-server
# flake8
# Do I want this? ^
# = JSON =
prettier


# Xorg
i3-wm
i3blocks
i3lock
xorg-server
xorg-xinput
gvim
xorg-xinit
# xsetroot for i3
# xorg-xsetroot
# ^ doesn't work with compton, but this does
hsetroot
compton
xclip
ttf-dejavu
rxvt-unicode
firefox-developer-edition
mpv
dmenu
chromium
# feh # replaces with sxiv
sxiv
youtube-dl
zathura
zathura-pdf-mupdf

# Is this needed?
# acpi
# bc
# playerctl
# alsa-utils
# sysstat
# atool
# autoconf
# automake
# baobab
# bind-tools
# binutils
# bpython
# coreutils
# bash
# cryptsetup
# deluge

# AUR
# yay
